# 1 შექმენით ფუნქცია, რომელიც გამოიტანს 'გამარჯობა', მინიშნება - არ არის არგუმენტები საჭირო
def greet():
    return "gamarjoba"

print(greet())

#2.შექმენით ფუნქცია რომელსაც გადააწოდებთ სახელს, შემდეგ გადაწოდებული სახელი ასე უნდა გამოიტანოს: "გამარჯობა {სახელი}!"
def hello(saxeli):
    print(f"gamarjoba {saxeli}")

hello("barbare")

#3.შექმენით ფუნქცია, რომელსაც გადააწოდებთ ორ პარამეტრს, და შემდეგ გამოიტანეთ ამ პარამეტრების / რიცხვების ჯამს
def jami(ricxvi1,ricxvi2):
    shedegi = ricxvi1 + ricxvi2
    print(shedegi)

jami(25,19)