# ცვლადი — ეს არის სახელი, რომელსაც პროგრამაში ვანიჭებთ რაღაც მნიშვნელობას, რომ შემდეგ ამ მნიშვნელობას მარტივად გამოვიყენოთ.
#მონაცემთა ტიპი — ეს არის ის, რა სახის ინფორმაცია ინახება ცვლადში. int (მთელი რიცხვი,float (ათწილადი რიცხვი),
#str (ტექსტი, string),bool(true or false)
#ტერმინალი — ეს არის პროგრამა, რომლის მეშვეობითაც ჩვენ ვაწერთ ბრძანებებს კომპიუტერისთვის ტექსტის სახით.
#print() ფუნქცია გამოიყენება იმისთვის, რომ  ეკრანზე გამოვიტანოთ ინფორმაცია ანუ ის აჩვენებს, რას წერს ან ითვლის პროგრამა. ფუნქციას 
# ყოველთვის სჭირდება ფრჩხილები, რადგან ფრჩხილებში ვწერთ, რა უნდა გააკეთოთ და რჩხილები არის იგივე სინტაქსი
#სინტაქსი ნიშნავს წერის წესებს პროგრამირების ენაში
# კომენტარს იყენებენ როცა რამე ტექს წერენ და არ უნდათ რომ error  დაეწეროს ამიტომ კომენტარის სახიტ წერენ
#ფუნქცია, რომელიც რიცხვს (მთელს ან ათწილადს) გადააქცევს სტრინგად,ოდში ეწოდება str().
#ცვლადის სახელი არასწორია, თუ:
#იწყება რიცხვით
#შეიცავს ჰარამწერს ან გამოტოვება
#იყენებს სპეცსიმბოლოებს (მაგ. @, #, $, %)
#ერთმაგი ბრჭყალი
#ორმაგი ბრჭყალი 
#სამმაგი ბრჭყალი
# არსებობს ორი boolean true and false
#input() ფუნქცია გამოიყენება იმისთვის, რომ მომხმარებელმა შეიყვანოს მონაცემი პროგრამის შესრულებისას.
#input() ფუნქცია ყოველთვის იღებს მონაცემს როგორც სტრინგს (str),
#input() ფუნქცია ყოველთვის იღებს მონაცემს როგორც სტრინგს (str),
# მიუხედავად იმისა, მომხმარებელი შეიყვანს რიცხვს, ტექსტს თუ ბულიანს.
# unda chavsvat int() rom moxdes matematikuri operacia
#Low-level და High-level პროგრამირების ენები ერთმანეთისგან განსხვავდებიან იმით, რამდენად ახლოს ან შორს არიან კომპიუტერის ენისგან (მანქანური კოდისგან).
#Low-level ენები ახლოს დგანან კომპიუტერის „ენასთან“  High-level ენები უფრო მარტივი და ადამიანისთვის გასაგებია.
#რადგან კომპიუტერის ენასთან უპრო ახლოსაStatement (გამოთქმა) — ეს არის ბრძანება, რომელსაც პროგრამა ასრულებს ნაბიჯ-ნაბიჯ.
#Statement (გამოთქმა) — ეს არის ბრძანება, რომელსაც პროგრამა ასრულებს ნაბიჯ-ნაბიჯ
#if-else statement — ეს არის პირობითი ბრძანება, რომელიც პროგრამას აძლევს არჩევანის გაკეთების საშუალებას.
#იგი ამოწმებს პირობას და თუ პირობა ჭეშმარიტია (True) — ასრულებს ერთ ბლოკს,
#თუ მცდარია (False) — ასრულებს მეორეს.
# ორი ვარიანტი 

age=int(input("enter ur name:"))
print(age,"wlis")
if age > 18:
   print("didi xar")
else:
   print("patara xar")