# რა არის key?
#key არის სახელწოდება (საკვანძო სიტყვა), რომლის საშუალებითაც ვპოულობთ მნიშვნელობას.
#მაგ: "სახელი" არის key.

 #რა არის value?
#value არის მონაცემი, რომელიც key-ს ეკუთვნის.
#მაგ: "ნინო" არის value.

 #რა განსხვავებაა dictionary-ს და list-ს შორის?
#Dictionary ინახავს მონაცემებს key და value წყვილებად.
#List ინახავს მონაცემებს მხოლოდ რიგითობით (ინდექსებით).

 #რა განსხვავებაა dictionary-ს და set-ს შორის?
#Dictionary აქვს key და value.
#Set ინახავს უნიკალურ ელემენტებს და არ აქვს key-ები.
#Set-ში ელემენტები არ მეორდება.
