# 1 პირობითი ოპერატორები
#პირობითი ოპერატორები გვაძლევს საშუალებას, პროგრამამ გადაწყვეტილება მიიღოს
#თუ პირობა მართალია, რაღაც გააკეთოს თუ არა სხვა რამ.
# 2 ოპერატორი რომელიც გვეხმარება ორე მეტი პირობა შევამოწმოთ
# 3 არის თუ არა რიცხვი 0-ზე მეტი (დადებითი)
# და იყოფა თუ არა 2-ზე ნაშთის გარეშე (ლუწია).
# თუ ორივე პირობა მართალია, დაიწერება — „რიცხვი დადებითი და ლუწია“,
# თუ არა — „პირობა არ შესრულდა“.
num=int(input("enter number:"))
if num % 2 == 1:
    print("კენტია")
else:
    print("ლუწია")
# 4 პროგრამა ამოწმებს, არის თუ არა რიცხვი 10-ზე ნაკლები ან ტოლი 0-ს.
# თუ კი — დაიწერება „ნააკლებია ან ნულია“,
# თუ არა — „არ აკმაყოფილებს“.
# 5 True and False or True or False and False and True or False and False საბოლო პასუხი არი true
# 6