#1) რა არის add() ჩაშენებული ფუნქცია?
#add() ამატებს ერთ ელემენტს სეტში.

s = {1, 2, 3}
s.add(4)

#2) რა არის union() ჩაშენებული ფუნქცია?
#union() აერთიანებს ორ სეტს და აბრუნებს ახალ სეტს.

a = {1, 2}
b = {3, 4}
c = a.union(b)

#3) რა არის discard() ჩაშენებული ფუნქცია?
#discard() შლის ელემენტს სეტიდან.
#თუ ელემენტი არ არსებობს — შეცდომა არ იქნება.

s = {1, 2, 3}
s.discard(2)


#4) რა არის remove() ჩაშენებული ფუნქცია?
#remove() შლის ელემენტს სეტიდან.
#თუ ელემენტი არ არსებობს — იქნება შეცდომა.

s = {1, 2, 3}
s.remove(2)


#5) რა არის update() ჩაშენებული ფუნქცია?
#update() ამატებს რამდენიმე ელემენტს ერთდროულად.

s = {1, 2}
s.update([3, 4, 5])


#6) რა განსხვავებაა discard()-სა და remove()-ს შორის?
#ფუნქცია	ელემენტი არ არსებობს
#discard() შეცდომა არ არის
#remove() შეცდომაა


#7) დაამატეთ სეტში ერთი ელემენტი
s = {1, 2}
s.add(3)


#8) დაამატეთ სეტში რამდენიმე ელემენტი
s = {1, 2}
s.update([3, 4, 5])


#9) სეტიდან წაშალეთ კონკრეტული ელემენტი
s = {1, 2, 3}
s.remove(2)


#10) სეტიდან წაშალეთ კონკრეტული ელემენტი (მეორე ხერხით)
s = {1, 2, 3}
s.discard(2)


#11) for ციკლით დაამატეთ ცარიელ სეტში 1-დან 20-მდე (add)
s = set()

for i in range(1, 21):
    s.add(i)




#12) for ციკლით დაამატეთ ცარიელ სეტში 1-დან 20-მდე (update)
s = set()

for i in range(1, 21):
    s.update([i])


#13) while ციკლით დაამატეთ 1-დან 20-მდე (add)
s = set()
i = 1

while i <= 20:
    s.add(i)
    i += 1


#14) while ციკლით დაამატეთ 1-დან 20-მდე (update)
s = set()
i = 1

while i <= 20:
    s.update([i])
    i += 1    
   


#15) while ციკლით სეტიდან ამოშალეთ ლუწი რიცხვები (discard)
s = set(range(1, 21))
i = 1

while i <= 20:
    if i % 2 == 0:
        s.discard(i)
    i += 1
